#Область ПрограммныйИнтерфейс

Функция ПогодаПоКоординатам(latitude, longitude) Экспорт
	
	
	// TODO На данный момент это единственная реалзиация пересчёта температуры, если нужно делать несколько пересчётов
	// температуры - нужно вынести пересчёт из Кельвинов в Цельсии в отдельный модуль
	ТемператураВКельвинах = -273.15;
	
	// TODO Изменить механику получения ключа апи на хранение настроек в базе
	КлючAPI = ТестовыйПример.Данные().КлючAPI;
	
	Попытка
		
		АдресСерверра = "api.openweathermap.org";
		СтрокаЗапросаПогоды = СтрШаблон("data/2.5/weather?lat=%1&lon=%2&APPID=%3", latitude, longitude, КлючAPI);
		
		// TODO Сделать универсальную реализацию обработки обращения к серверу.
		Соединение = Новый HTTPСоединение(АдресСерверра);
		Запрос = Новый HTTPЗапрос(СтрокаЗапросаПогоды);
		
		Ответ = Соединение.ВызватьHTTPМетод("GET", Запрос);
		
		Если Ответ.КодСостояния = 200 Тогда
		
			Результат = Ответ.ПолучитьТелоКакСтроку();
	
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(Результат);
			РезультатПреобразования = ПрочитатьJSON(Чтение);
			
			ПогодаПоКоординатам = ТемператураВКельвинах + РезультатПреобразования.main.temp;
			
		Иначе
			
			ПогодаПоКоординатам = Неопределено;
			
		КонецЕсли;

	Исключение
			
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ПогодаПоКоординатам",
			УровеньЖурналаРегистрации.Ошибка,
			,
			СтрШаблон("latitude=%1, longitude=%2", latitude, longitude),
			ОписаниеОшибки);
		
		ПогодаПоКоординатам = Неопределено;
			
	КонецПопытки;
	
	Возврат ПогодаПоКоординатам;

КонецФункции

#КонецОбласти
