
#Область СлужебныйПрограммныйИнтерфейс

Функция Данные() Экспорт
	
	Данные = Новый Структура;
	
	// Ключ API для openweathermap
	Данные.Вставить("КлючAPI", "26b95bbbd9d9a1cbcee1603b6ee4eb4f");
	
	// Координаты Москвы
	Данные.Вставить("latitude", 55.7522);
	Данные.Вставить("longitude", 37.6156);
	
	Возврат Данные;
	
КонецФункции

Функция ПогодаВМоскве() Экспорт

	latitude = ТестовыйПример.Данные().latitude;
	longitude = ТестовыйПример.Данные().longitude;
	
	Возврат Погода.ПогодаПоКоординатам(latitude, longitude);
	
КонецФункции
#КонецОбласти

